Autodesk.Revit.DB.ImageType.Unload
Unload the linked image.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ImageType is not a link.
-or-
The image is a PDF based image, but PDF import is not available in the installed Revit.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Since:
2021

Autodesk.Revit.DB.ImageType.ReloadFrom(Autodesk.Revit.DB.ImageTypeOptions)
Reloads the image in the ImageType from a new image file, and for a new Autodesk.Revit.DB.ImageType.PageNumber.
Remarks:
If reload fails (because the image file doesn't exist, cannot be read, or does not have the requested page number),
the currently loaded image will remain unchanged.
options:
Options that specify what image to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options.Path is an empty string.
-or-
The file represented by options.Path is not a supported image file type.
-or-
The image file represented by options.Path is a password protected PDF file.
-or-
The image file represented by options.Path does not contain the page specified by options.PageNumber.
-or-
The image file represented by options.Path could not be read and may be corrupt.
-or-
An error occurred while handling the external resource corresponding to the image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file represented by options.Path does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ImageType was not loaded from a file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The image file represented by options.Path is a PDF file, but PDF import is not available in the installed Revit.
Since:
2020

Autodesk.Revit.DB.ImageType.ReloadFrom(System.String)
Reloads the ImageType from a new image file.
Remarks:
If the image file contains multiple pages the first page will be loaded.
If reload fails the currently loaded image will remain unchanged.
imagePath:
A new path to an image file to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided path is not a local path.
-or-
imagePath is an empty string.
-or-
The file represented by imagePath is not a supported image file type.
-or-
The image file represented by imagePath is a password protected PDF file.
-or-
The image file represented by imagePath could not be read and may be corrupt.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file represented by imagePath does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ImageType was not loaded from a file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The image file represented by imagePath is a PDF file but PDF import is not available in the installed Revit.
Since:
2015

Autodesk.Revit.DB.ImageType.IsLoadedFromFile
Checks whether the ImageType was loaded from a file.
Revit may generate some ImageTypes internally, such as the ImageTypes created by "Save to Project as Image".
Returns:
True if the ImageType was loaded from a file, False otherwise.
Since:
2015

Autodesk.Revit.DB.ImageType.Reload
Reloads the ImageType from the file found at the location specified by the Autodesk.Revit.DB.ImageType.Path property,
using the same Autodesk.Revit.DB.ImageType.PageNumber and resolution.
Remarks:
If reload fails (because the image file doesn't exist, cannot be read, or does not have the correct page),
the currently loaded image will remain unchanged.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The file represented by Path does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ImageType was not loaded from a file.
-or-
The file represented by Path is not a supported image file type.
-or-
The image file represented by Path is a password protected PDF file.
-or-
The image file represented by Path does not contain the page specified by PageNumber.
-or-
The image file represented by Path could not be read and may be corrupt.
-or-
An error occurred while handling the external resource corresponding to the image.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The image file represented by Path is a PDF file, but PDF import is not available in the installed Revit.
Since:
2015

Autodesk.Revit.DB.ImageType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ImageTypeOptions)
Creates a new ImageType element and loads the image into it.
Remarks:
The ImageType will be created but will not be placed into any view.
document:
The document.
options:
Options that specify what image to load.
Returns:
The new ImageType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The image filename is an empty string.
-or-
The image file is not a supported image file type.
-or-
The image file is password protected.
-or-
The image file does not contain the requested page number.
-or-
The image file could not be read and may be corrupt.
-or-
An error occurred while handling the external resource corresponding to the image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The image file does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The image file is a PDF file, but PDF import is not available in the installed Revit.
Since:
2020

Autodesk.Revit.DB.ImageType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new ImageType element and loads the image into it.
Remarks:
The ImageType will be created but will not be placed into any view.
document:
The document.
imagePath:
A path to an image file to load.
Returns:
The new ImageType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided path is not a local path.
-or-
imagePath is an empty string.
-or-
The file represented by imagePath is not a supported image file type.
-or-
The image file represented by imagePath is a password protected PDF file.
-or-
The image file represented by imagePath could not be read and may be corrupt.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file represented by imagePath does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The image file represented by imagePath is a PDF file but PDF import is not available in the installed Revit.
Since:
2015

Autodesk.Revit.DB.ImageType.IsViewImage
The ImageType was created via "Save to Project as Image" function. For such ImageTypes the file path is an empty string.
Since:
2020